---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassSurfaceData.IsUnderground
source: html/31d63dc4-429b-c2b2-bd42-6b7f30d16147.htm
---
# Autodesk.Revit.DB.Analysis.MassSurfaceData.IsUnderground Property

Indicates if the roof, floor, slab, or wall surface reference is underground.

## Syntax (C#)
```csharp
public bool IsUnderground { get; set; }
```